---
kind: type
id: T:Autodesk.Revit.DB.Analysis.FieldDomainPointsByXYZ
source: html/e3715e8d-786b-e04e-f03b-a1b9b1c86ba8.htm
---
# Autodesk.Revit.DB.Analysis.FieldDomainPointsByXYZ

Represents a set of three-dimensional point coordinates

## Syntax (C#)
```csharp
public class FieldDomainPointsByXYZ : FieldDomainPoints
```